import React from 'react';
import Item from './OfficeControlItem';
import photo1 from '../../assets/img/officeControl-4.jpg';
import photo2 from '../../assets/img/officeControl-5.jpg';
import photo3 from '../../assets/img/officeControl-6.jpg';
import s from './style.module.scss';

export default function OfficeControlList() {
  return (
    <ul className={s.officeControlList}>
      <Item
        text='לא משנה אם אתם עובדים בחדר השינה, או בחדר עבודה ייעודי ורחב יותר - תמצאו חלל שניתן להיכנס אליו, לסגור את הדלת ולהשאיר בחוץ את העולם שאינו שייך לעבודה. 
אם אזור העבודה שלכם הוא לא חדר נפרד, ניתן להוסיף פרגוד (מתחיל מכמה מאות שקלים שפויים לחלוטין). לחלופין, אפשר גם לייצר חציצה בעזרת עציצים גבוהים שמונחים על הריצפה או בעזרת שידה מוארכת ועליה העציצים. זכרו שהאפשרות להגדיר אזור בבית כחלל עבודה ובמקביל להנהיג טקס תחילת יום, (הכנת קפה ראשון, למשל) גם יעשה לכם סדר וגם יגדיר את הלו"ז לשאר הדיירים בבית. 
'
        id="1"
      />
      <Item
        text="אם אין לכם שולחן כתיבה מתאים ולא בא לכם להתפשר על משהו גנרי ומשעמם, תוכלו לקנות 2 שידות צד בגובה המתאים, ועליהן להניח פלטת בוצ'ר או כל עץ אחר. "
        id="2"
      />
      <Item
        text='שבו כמו שצריך. זה לא רק משפט של מורים. קחו בחשבון שגובה שולחן עבודה מחושב לפי ממוצע משוקלל של אנשים בוגרים ונקבע על 76-72 ס"מ. לכן חשוב שתתמקמו מול שולחן עבודה שאינו שולחן קפה נמוך או בר גבוה. בסוף ישנה משמעות אמיתית לזווית הישיבה שלנו על העייפות שנצבור, ואתם לא רוצים להעביר ימי עבודה שלמים מול מחשב כשהישיבה לא נוחה לכם. את המסך, אם כבר מדברים, רצוי להציב בקו ישר מול העיניים, בערך במרחק של אמה מכם. אם כפות הרגליים שלכם מונחות לגמרי על הרצפה, והידיים כולל המרפקים מונחות על השולחן תדעו שאתם עושים זאת נכון. כך גם תימנעו מכאבי כתפיים וצוואר. '
        id="3"
      />
      <Item
        text="זה תלוי במיקום של פינת העבודה בחלל הבית, אבל אפשר להגדיר אותה על ידי צביעה בגוון אחר של הקיר שממול לפי המידות של שולחן הכתיבה. כלומר, אם השולחן שלכם ברוחב 1.20 מטר, אז נצבע את הקיר שמולו ברוחב של 1.20 מטר. "
        id="4"
        img={photo1}
      />
      <Item
        text='שימו לב לרקע שלכם. כלומר, לדברים שמאחורי הגב שלכם. אף אחד בישיבת הוידאו שלכם לא חייב להתרשם מגובהה של ערימת הכביסה או האופניים החדשים של הילד. זה לא רק עניין של לא נעים . המרחב שמהווה את הרקע שלנו משפיע על קליטת המסרים של מי שמדבר אלינו ואיתנו. זה אומר שיהיו אנשים שינטו לבחון את המרחב שלנו ובלי לשים לב לא יהיו קשובים בגלל " הכאוס" או הפעילות שמתרחשת סביבנו."'
        id="5"
      />
      <Item
        text="תכניסו אור הביתה. ואנחנו לא מתכוונים רק לכזה שמגיע מבחוץ. כי גם אם יש לכם חלון גדול בחדר, התאורה הטבעית משתנה משעה לשעה ומעונה לעונה, וקשה להסתמך על זה. דאגו לשני מקורות אור, אחד שיספק פתרון טכני של תאורה שוטפת שמאירה את כל החדר, ומקור נוסף שיהיה ממוקד יותר, ויספק אווירה ונחמדה. אה, וכמובן כזאת שתחמיא לנו תוך כדי הזום.  "
        id="6"
        img={photo2}
      />
      <Item
        text="תשקיעו בפרטים! בתכלס, בכל תחביב או עיסוק חדש, החלק של ההתעסקות באקססוריז הוא הכיפי ביותר. עם כל הכבוד לשולחן העבודה שאולי קניתם במיוחד, או לכיסא המשוכלל שהצבתם מולו ולמנורת השולחן עתירת המצבים, עדיין צריך לרדת לפרטים הקטנים. אז אל תתביישו לאבזר את פינת העבודה שלכם עם איזה פיס ייחודי ומגניב. אל תוותרו גם על קטנות כמו דפי ממו, עטים ועפרונות, או תחתית מגניבה לספל הקפה ההוא מהבוקר. אתם יודעים, כל דבר שיהיה לכם נעים לברוח אליו כשהעיניים מתעייפות מהמסך. בחרו תמונה יפה שלא יימאס לכם להסתכל עליה, משפטי השראה (אם זה משהו שעובד עליכם), לוח מחיק שעליו אפשר לכתוב משימה יומית או סתם ציור של הילדים. שטיחון מתחת לשולחן העבודה תמיד יספק אווירה חמימה יותר, ומדף מעל השולחן שעליו נניח עציץ ירוק נשפך – תמיד יוסיף טאצ נעים יותר. אתם הולכים להעביר כאן לא מעט זמן, אז כדאי שתפיקו מזה את המקסימום.  "
        id="7"
      />

      <Item
        text="פנקו את עצמכם. זה שעכשיו אתם אלו שדואגים לקפה לא אומר שצריך להתפשר על כלום. ורטו של Nespresso תסגור לכם את הפינה הזאת בקלות, ביעילות, ומבלי לוותר על מיליליטר של איכות. וזהו, החלק של העוגייה בצד זה כבר אופציונלי. "
        id="8"
        img={photo3}
      />
    </ul>
  );
}
